# Тема “Вычисления с помощью Numpy”

### Задание 1
Импортируйте библиотеку Numpy и дайте ей псевдоним np.
Создайте массив Numpy под названием a размером 5x2, то есть состоящий из 5 строк и 2 столбцов.
Первый столбец должен содержать числа 1, 2, 3, 3, 1, а второй - числа 6, 8, 11, 10, 7. Будем считать,
что каждый столбец - это признак, а строка - наблюдение. Затем найдите среднее значение по
каждому признаку, используя метод mean массива Numpy. Результат запишите в массив mean_a, в
нем должно быть 2 элемента.

In [325]:
import numpy as np

In [326]:
a = np.transpose(np.array([[1, 2, 3, 3, 1], [6, 8, 11, 10, 7]]))
print(f'Массив a: \n {a} \n')
print(f'Форма массива a: \n {a.shape}')

Массив a:
 [[ 1  6]
 [ 2  8]
 [ 3 11]
 [ 3 10]
 [ 1  7]]

Форма массива a:
 (5, 2)

In [327]:
mean_a = a.mean(axis = 0)
print(f'Массив mean_a: \n {mean_a} \n')
print(f'Форма массива mean_a: \n {mean_a.shape}')

Массив mean_a:
 [2.  8.4]

Форма массива mean_a:
 (2,)

### Задание 2
Вычислите массив a_centered, отняв от значений массива “а” средние значения соответствующих
признаков, содержащиеся в массиве mean_a. Вычисление должно производиться в одно действие.
Получившийся массив должен иметь размер 5x2.

In [328]:
a_centered = np.subtract(a, mean_a)
print(f'Массив a_centered: \n {a_centered} \n')
print(f'Форма массива a_centered: \n {a_centered.shape}')

Массив a_centered:
 [[-1.  -2.4]
 [ 0.  -0.4]
 [ 1.   2.6]
 [ 1.   1.6]
 [-1.  -1.4]]

Форма массива a_centered:
 (5, 2)

### Задание 3
Найдите скалярное произведение столбцов массива a_centered. В результате должна получиться
величина a_centered_sp. Затем поделите a_centered_sp на N-1, где N - число наблюдений.

In [329]:
a_centered_sp = a_centered[:, 0].dot(a_centered[:, 1])
a_centered_sp

8.0

In [330]:
N = a.shape[0]
N

5

In [331]:
c1 = a_centered_sp / (N - 1)
c1

2.0

### Задание 4**
Число, которое мы получили в конце задания 3 является ковариацией двух признаков, содержащихся
в массиве “а”. В задании 4 мы делили сумму произведений центрированных признаков на N-1, а не на
N, поэтому полученная нами величина является несмещенной оценкой ковариации.

В этом задании проверьте получившееся число, вычислив ковариацию еще одним способом - с
помощью функции np.cov. В качестве аргумента m функция np.cov должна принимать
транспонированный массив “a”. В получившейся ковариационной матрице (массив Numpy размером
2x2) искомое значение ковариации будет равно элементу в строке с индексом 0 и столбце с индексом
1.

In [332]:
cov_m = np.cov(np.transpose(a), y=None, rowvar=True, bias=False, ddof=None, fweights=None, aweights=None)
cov_m

array([[1. , 2. ],
       [2. , 4.3]])

In [333]:
c2 = cov_m[0, 1]
c2

2.0

In [334]:
if c1 == c2:
    print('correct')
else:
    print('error')

correct

# Тема “Работа с данными в Pandas”

### Задание 1

Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].

Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [335]:
import pandas as pd

In [336]:
authors = pd.DataFrame({
    'author_id': [1, 2, 3],
    'author_name': ['Тургенев', 'Чехов', 'Островский']})
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [337]:
book = pd.DataFrame({
    'author_id': [1, 1, 1, 2, 2, 3, 3],
    'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 
                   'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    'price': [450, 300, 350, 500, 450, 370, 290]})
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание 2

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [338]:
authors_price = pd.merge(authors, book, on='author_id', how='outer')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими
книгами.

In [339]:
top5 =  authors_price.sort_values(by='price', ascending=False).head(5)
top5.reset_index(drop=True, inplace=True)
top5

   author_id author_name         book_title  price
0          2       Чехов   Толстый и тонкий    500
1          1    Тургенев        Отцы и дети    450
2          2       Чехов    Дама с собачкой    450
3          3  Островский              Гроза    370
4          1    Тургенев  Дворянское гнездо    350

### Задание 4

Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price, в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

###### Задание 4, вариант 1

In [340]:
authors_stat = pd.DataFrame({'author_name': [], 'min_price': [], 'max_price': [], 'mean_price': []})
authors_stat

Empty DataFrame
Columns: [author_name, min_price, max_price, mean_price]
Index: []

In [341]:
authors_stat[['author_name', 'min_price', 'max_price', 'mean_price']] = authors_price[['author_name', 'price', 'price', 'price']]
authors_stat

  author_name  min_price  max_price  mean_price
0    Тургенев        450        450         450
1    Тургенев        300        300         300
2    Тургенев        350        350         350
3       Чехов        500        500         500
4       Чехов        450        450         450
5  Островский        370        370         370
6  Островский        290        290         290

In [342]:
authors_stat = authors_stat.groupby('author_name').agg({"min_price": "min", "max_price": "max", "mean_price": "mean"})
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

###### Задание 4, вариант 2

In [343]:
authors_stat = pd.DataFrame({'author_name': authors_price['author_name'], 
                             'min_price': authors_price['price'], 
                             'max_price': authors_price['price'], 
                             'mean_price': authors_price['price']})
authors_stat

  author_name  min_price  max_price  mean_price
0    Тургенев        450        450         450
1    Тургенев        300        300         300
2    Тургенев        350        350         350
3       Чехов        500        500         500
4       Чехов        450        450         450
5  Островский        370        370         370
6  Островский        290        290         290

In [344]:
authors_stat = authors_stat.groupby('author_name').agg({"min_price": "min", "max_price": "max", "mean_price": "mean"})
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

### Задание 5**

Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].

Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию d.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.

Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь,что датафреймы book_info и book_info2 идентичны.

In [345]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [346]:
""" Как, если бы numpy не был импортирован до этого """
import numpy as np

In [347]:
book_info = pd.pivot_table(
    authors_price, 
    values='price', 
    index=['author_name'], 
    columns=['cover'], 
    aggfunc=np.sum, fill_value=0)
book_info

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [348]:
book_info.to_pickle('book_info.pkl')

In [349]:
book_info2 = pd.read_pickle('book_info.pkl')
book_info2

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [350]:
result = pd.concat([book_info, book_info2]).drop_duplicates(keep=False)

In [351]:
if result.shape[0] == 0:
    print('correct')
else:
    print('error')

correct

In [352]:
import os
file_path = os.path.abspath('book_info.pkl')
os.remove(file_path)